Revit 2024 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementOutSideOfHost Property
 Area Reinforcement is sketched completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AreaReinforcementOutSideOfHost { get; }
Visual Basic
Public Shared ReadOnly Property AreaReinforcementOutSideOfHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AreaReinforcementOutSideOfHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace